---
type: MeshTriangle
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# MeshTriangle

`Autodesk.Revit.DB.MeshTriangle` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Index | — | `public uint this [ int idx ] { get ; }` |
| Property | Vertex | — | `public XYZ this [ int idx ] { get ; }` |